boblemaire/esp32HTTPrequest/esp32HTTPrequest.cpp
#include "esp32HTTPrequest.h"

// ESP32 does not seem to reliably handle multiple cocurrent TLS requests.
// This semaphore controls the number of concurrent requests.
// ESP32_HTTP_REQUEST_MAX_TLS can be set to allow more than one.
// The semaphore is created in the constructor of the first instance
// of esp32HTTPrequest and the handle is saved here.

SemaphoreHandle_t TLSlock_S = nullptr;

//**************************************************************************************************************
esp32HTTPrequest::esp32HTTPrequest()
    : _readyState(readyStateUnsent)
    , _HTTPcode(0)
    , _chunked(false)
    , _debug(DEBUG_IOTA_HTTP_SET)
    , _async(false)
    , _timeout(DEFAULT_RX_TIMEOUT)
    , _lastActivity(0)
    , _requestStartTime(0)
    , _requestEndTime(0)
    , _connectedHost(nullptr)
    , _connectedPort(-1)
    , _client(nullptr)
    , _contentLength(0)
    , _contentRead(0)
    , _readyStateChangeCB(nullptr)
    , _readyStateChangeCBarg(nullptr)
    , _onDataCB(nullptr)
    , _onDataCBarg(nullptr)
    , _URL(nullptr)
    , _request(nullptr)
    , _response(nullptr)
    , _headers(nullptr)
{
    DEBUG_HTTP("New request.");
#ifdef ESP32
    threadLock = xSemaphoreCreateRecursiveMutex();
    if( ! TLSlock_S){
        TLSlock_S = xSemaphoreCreateCounting(ESP32_HTTP_REQUEST_MAX_TLS, ESP32_HTTP_REQUEST_MAX_TLS);
    } 
#endif
}

//**************************************************************************************************************
esp32HTTPrequest::~esp32HTTPrequest(){
    if(_client){
        esp_http_client_cleanup(_client);
        _client = nullptr;
    }
    delete _headers;
    delete _request;
    delete _response;
    delete[] _connectedHost;
#ifdef ESP32
    vSemaphoreDelete(threadLock);
#endif
}

//**************************************************************************************************************
void    esp32HTTPrequest::setDebug(bool debug){
    if(_debug || debug) {
        _debug = true;
        DEBUG_HTTP("setDebug(%s) version %s\r\n", debug ? "on" : "off", esp32HTTPrequest_h);
    }
	_debug = debug;
}

//**************************************************************************************************************
bool    esp32HTTPrequest::debug(){
    return(_debug);
}

//**************************************************************************************************************
bool	esp32HTTPrequest::open(const char* method, const char* url){
    DEBUG_HTTP("open(%s, %.*s)\r\n", method, strlen(url), url);
    if(_readyState != readyStateUnsent && _readyState != readyStateDone) {return false;}
    _requestStartTime = millis();
    delete _headers;
    delete _request;
    delete _response;
    _headers = nullptr;
    _response = nullptr;
    _request = nullptr;
    _chunked = false;
    _contentRead = 0;
    _readyState = readyStateUnsent;
    if( ! _parseURL(url)){
        DEBUG_HTTP("_parseURL failed\n");
        return false;
    }
    _addHeader("host", _URL->host);
    if (strcmp(method, "GET") == 0) {
        _HTTPmethod = HTTP_METHOD_GET;
    } else if (strcmp(method, "POST") == 0) {
        _HTTPmethod = HTTP_METHOD_POST;
    } else 
        return false;

    if(!_client){
        esp_http_client_config_t config;
        memset(&config, 0, sizeof(config));
        config.url = url,
        config.method = _HTTPmethod;
        config.event_handler = http_event_handle;
        config.user_data = this;
        _client = esp_http_client_init(&config);
        if(!_client){
           DEBUG_HTTP("client_init failed\n");
           return false;
        }
    }
    else {
        esp_http_client_set_method(_client, _HTTPmethod);
        esp_http_client_set_url(_client, url);
    }
    _lastActivity = millis();
    return true;
}
//**************************************************************************************************************
void    esp32HTTPrequest::onReadyStateChange(readyStateChangeCB cb, void* arg){
    _readyStateChangeCB = cb;
    _readyStateChangeCBarg = arg;
}

//**************************************************************************************************************
void	esp32HTTPrequest::setTimeout(int seconds){
    DEBUG_HTTP("setTimeout(%d)\r\n", seconds);
    _timeout = seconds;
}

//**************************************************************************************************************
bool	esp32HTTPrequest::send(){
    DEBUG_HTTP("send()\r\n");
    _seize;
    _send(_request, 0);
    _release;
    return true;
}

//**************************************************************************************************************
bool    esp32HTTPrequest::send(String body){
    DEBUG_HTTP("send(String) %s... (%d)\r\n", body.substring(0,16).c_str(), body.length());
    _seize;
    _request = (char *)ps_malloc(body.length()); //new char[body.length()];
    memcpy(_request, body.c_str(), body.length());
    _send(_request, body.length());
    _release;
    return true;
}

//**************************************************************************************************************
bool	esp32HTTPrequest::send(const char* body){
    DEBUG_HTTP("send(char*) %s.16... (%d)\r\n",body, strlen(body));
    _seize;
    _send(body, strlen(body));
    _release;
    return true;
}

//**************************************************************************************************************
bool	esp32HTTPrequest::send(const uint8_t* body, size_t len){
    DEBUG_HTTP("send(char*) %s.16... (%d)\r\n",(char*)body, len);
    _seize;
    _send((char*)body, len);
    _release;
    return true;
}

//**************************************************************************************************************
bool	esp32HTTPrequest::send(xbuf* body, size_t len){
    DEBUG_HTTP("send(char*) %s.16... (%d)\r\n", body->peekString(16).c_str(), len);
    _seize;
    _request = (char *)ps_malloc(len);
    body->read((uint8_t*)_request, len);
    _send(_request, len);
    _release;
    return true;
}

//**************************************************************************************************************
void    esp32HTTPrequest::abort(){
    DEBUG_HTTP("abort()\r\n");
    _seize;
    if(! _client) return;
    esp_http_client_cleanup(_client);
    _client = nullptr;
    _release;
}
//**************************************************************************************************************
int		esp32HTTPrequest::readyState(){
    return _readyState;
}

//**************************************************************************************************************
int	esp32HTTPrequest::responseHTTPcode(){
    return _HTTPcode;
}

//**************************************************************************************************************
String	esp32HTTPrequest::responseText(){
    DEBUG_HTTP("responseText() ");
    _seize;
    if( ! _response || _readyState < readyStateLoading || ! available()){
        DEBUG_HTTP("responseText() no data\r\n");
        _release;
        return String(); 
    }       
    size_t avail = available();
    String localString = _response->readString(avail);
    if(localString.length() < avail) {
        DEBUG_HTTP("!responseText() no buffer\r\n")
        _HTTPcode = HTTPCODE_TOO_LESS_RAM;
        esp_http_client_close(_client);
        _client = nullptr;
        return String();
    }
    _contentRead += localString.length();
    DEBUG_HTTP("responseText() %s... (%d)\r\n", localString.substring(0,16).c_str() , avail);
    _release;
    return localString;
}

//**************************************************************************************************************
size_t  esp32HTTPrequest::responseRead(uint8_t* buf, size_t len){
    if( ! _response || _readyState < readyStateLoading || ! available()){
        DEBUG_HTTP("responseRead() no data\r\n");
        return 0;
    } 
    _seize;
    size_t avail = available() > len ? len : available();
    _response->read(buf, avail);
    DEBUG_HTTP("responseRead() %.16s... (%d)\r\n", (char*)buf , avail);
    _contentRead += avail;
    _release;
    return avail;
}

//**************************************************************************************************************
size_t	esp32HTTPrequest::available(){
    if(_readyState < readyStateLoading) return 0;
    if(_chunked && (_contentLength - _contentRead) < _response->available()){
        return _contentLength - _contentRead;
    }
    return _response->available();
}

//**************************************************************************************************************
size_t	esp32HTTPrequest::responseLength(){
    if(_readyState < readyStateLoading) return 0;
    return _contentLength;
}

//**************************************************************************************************************
void	esp32HTTPrequest::onData(onDataCB cb, void* arg){
    DEBUG_HTTP("onData() CB set\r\n");
    _onDataCB = cb;
    _onDataCBarg = arg;
}

//**************************************************************************************************************
uint32_t esp32HTTPrequest::elapsedTime(){
    if(_readyState <= readyStateOpened) return 0;
    if(_readyState != readyStateDone){
        return millis() - _requestStartTime;
    }
    return _requestEndTime - _requestStartTime;
}

//**************************************************************************************************************
String esp32HTTPrequest::version(){
    return String(esp32HTTPrequest_h);
}

/*______________________________________________________________________________________________________________

               PPPP    RRRR     OOO    TTTTT   EEEEE    CCC    TTTTT   EEEEE   DDDD
               P   P   R   R   O   O     T     E       C   C     T     E       D   D
               PPPP    RRRR    O   O     T     EEE     C         T     EEE     D   D
               P       R  R    O   O     T     E       C   C     T     E       D   D
               P       R   R    OOO      T     EEEEE    CCC      T     EEEEE   DDDD
_______________________________________________________________________________________________________________*/

