boblemaire/esp32HTTPrequest/esp32HTTPrequest.cpp
size_t  esp32HTTPrequest::_send(const char* body, size_t len){
    DEBUG_HTTP("_send() %d\r\n", len);
    if(_HTTPmethod == HTTP_METHOD_POST){
        _addHeader("Content-Length", String(len).c_str());
    }
    header* hdr = _headers;
    while(hdr){
        esp_http_client_set_header(_client, hdr->name, hdr->value);
        hdr = hdr->next;
    }
    delete _headers;
    _headers = nullptr;
    _requestLen = len;
    if(len){
      esp_http_client_set_post_field(_client, body, len);
    }
    bool isTLS = strcmp(_URL->scheme, "HTTPS") == 0;
    if(isTLS){
        xSemaphoreTake(TLSlock_S, portMAX_DELAY);
    }
    esp_err_t err;
    do{
        err = esp_http_client_perform(_client);
    } while(err == ESP_ERR_HTTP_EAGAIN);
    if(isTLS){
        xSemaphoreGive(TLSlock_S);
    }
     if(err != ESP_OK){
         _HTTPcode = HTTPCODE_PERFORM_FAILED;
         Serial.printf("perform failed %d, %s\n", err, esp_err_to_name(err));
         DEBUG_HTTP("perform failed  %s\r\n", esp_err_to_name(err));
         abort();
         _setReadyState(readyStateDone);
    }
    _lastActivity = millis(); 
    return len;
}

//**************************************************************************************************************
void  esp32HTTPrequest::_setReadyState(readyStates newState){
    if(_readyState != newState){
        _readyState = newState;          
        DEBUG_HTTP("_setReadyState(%d)\r\n", _readyState);
        if(_readyStateChangeCB){
            _readyStateChangeCB(_readyStateChangeCBarg, this, _readyState);
        }
    } 
}

//**************************************************************************************************************
bool  esp32HTTPrequest::_parseURL(const char* url){
    delete _URL;
    _URL = new URL;
    _URL->buffer = new char[strlen(url) + 8];
    char *bufptr = _URL->buffer;
    const char *urlptr = url;

        // Find first delimiter

    int seglen = strcspn(urlptr, ":/?");

        // scheme

    _URL->scheme = bufptr;
    if(! memcmp(urlptr+seglen, "://", 3)){
        while(seglen--){
            *bufptr++ = toupper(*urlptr++);
        }
        urlptr += 3;
        seglen = strcspn(urlptr, ":/?");
    }
    else {
        memcpy(bufptr, "HTTP", 4);
        bufptr += 4;
    }
    *bufptr++ = 0;

        // host

    _URL->host = bufptr;
    memcpy(bufptr, urlptr, seglen);
    bufptr += seglen;
    *bufptr++ = 0;
    urlptr += seglen;

        // port

    _URL->port = bufptr;
    if(*urlptr == ':'){
        urlptr++;
        seglen = strcspn(urlptr, "/?");
        memcpy(bufptr, urlptr, seglen);
        bufptr += seglen;
        urlptr += seglen;
    }
    *bufptr++ = 0;

        // path 

    _URL->path = bufptr;
    *bufptr++ = '/';
    if(*urlptr == '/'){
        seglen = strcspn(++urlptr, "?");
        memcpy(bufptr, urlptr, seglen);
        bufptr += seglen;
        urlptr += seglen;
    }
    *bufptr++ = 0;

        // query

    _URL->query = bufptr;
    if(*urlptr == '?'){
        seglen = strlen(urlptr);
        memcpy(bufptr, urlptr, seglen);
        bufptr += seglen;
        urlptr += seglen;
    }
    *bufptr++ = 0;

    DEBUG_HTTP("_parseURL() %s://%s:%d%s%.16s\r\n", _URL->scheme, _URL->host, _URL->port, _URL->path, _URL->query);
    return true;
}

/*______________________________________________________________________________________________________________

EEEEE   V   V   EEEEE   N   N   TTTTT         H   H    AAA    N   N   DDDD    L       EEEEE   RRRR     SSS
E       V   V   E       NN  N     T           H   H   A   A   NN  N   D   D   L       E       R   R   S 
EEE     V   V   EEE     N N N     T           HHHHH   AAAAA   N N N   D   D   L       EEE     RRRR     SSS
E        V V    E       N  NN     T           H   H   A   A   N  NN   D   D   L       E       R  R        S
EEEEE     V     EEEEE   N   N     T           H   H   A   A   N   N   DDDD    LLLLL   EEEEE   R   R    SSS 
_______________________________________________________________________________________________________________*/

// Event callback from esp_http_client.
// Pickup class context and jump into class handler.

esp_err_t http_event_handle(esp_http_client_event_t *evt)
{
    esp32HTTPrequest *_this = (esp32HTTPrequest*)evt->user_data;
    return _this->_http_event_handle(evt);
}

esp_err_t esp32HTTPrequest::_http_event_handle(esp_http_client_event_t * evt)
{
    esp32HTTPrequest *_this = (esp32HTTPrequest*)evt->user_data;
    switch(evt->event_id) {
        case HTTP_EVENT_ERROR:
            DEBUG_HTTP("HTTP_EVENT_ERROR\n");
            break;
        case HTTP_EVENT_ON_CONNECTED:
            DEBUG_HTTP("client connected event\n");
            _setReadyState(readyStateOpened);
            break;
        case HTTP_EVENT_HEADER_SENT:
            DEBUG_HTTP("headers sent event\n");
            break;
        case HTTP_EVENT_ON_HEADER:
            DEBUG_HTTP("header received event %s:%s\n", evt->header_key, evt->header_value);
            _addHeader(evt->header_key, evt->header_value);
            break;
        case HTTP_EVENT_ON_DATA:
            DEBUG_HTTP("on-data event, len=%d\n", evt->data_len);
            _setReadyState(readyStateHdrsRecvd);
            _onData(evt->data, evt->data_len);
            break;
        case HTTP_EVENT_ON_FINISH:
            DEBUG_HTTP("client finish event\n");
            _HTTPcode = esp_http_client_get_status_code(_client);
            _setReadyState(readyStateDone);
            delete _request;
            _request = nullptr;
            while(_onDataCB && _response->available()){
                _lastActivity = millis(); 
                _onDataCB(_onDataCBarg, this, available());
            }
            break;
        case HTTP_EVENT_DISCONNECTED:
            DEBUG_HTTP("disconnect event\n");
            break;
    }
    return ESP_OK;
}

//**************************************************************************************************************
void  esp32HTTPrequest::_onData(void* Vbuf, size_t len){
    DEBUG_HTTP("_onData handler %.16s... (%d)\r\n",(char*) Vbuf, len);
    _seize;
    _lastActivity = millis();

    if(!_chunked && esp_http_client_is_chunked_response(_client)){
        _chunked = true;
        DEBUG_HTTP("Response is chunked.\n");
    } 
              
    if(! _response){
        _response = new xbuf;
        _contentRead = 0;
        if (_chunked)
            _contentLength = 0;
        else
            _contentLength = esp_http_client_get_content_length(_client);
    }
    
                // Transfer data to xbuf

    _response->write((uint8_t*)Vbuf, len);
    if(_chunked){
        _contentLength += len;
    }

